src/InformationRegisters/ar_ДействияАгента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ar_ДействияАгента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ar_ИмяИнструмента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_АргументыJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_УровеньРиска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ar_УровеньРиска</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_СсылкаНаРезультат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_КемПодтверждено</Name>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ДатаПодтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ДлительностьМС</Name>
					<Comment>Длительность вызова tool в миллисекундах: от начала выполнения реализации до возврата результата или исключения. Заполняется ВСЕГДА, независимо от флага ar_ЗамерПроизводительности и наличия подсистемы БСП "Оценка производительности". 0 означает "не измерено" (например запись создана не из ar_ИнструментыДиспетчер.Вызвать). PERF-04.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ar_ЗавершёнСОшибкой</Name>
					<Comment>Вызов завершился ошибкой: исключение реализации либо observation с ключом "error". Нужен для статистики PERF-05 - сам текст observation в регистре не хранится, восстановить признак постфактум нельзя.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ar_ИдентификаторЗапуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ar_Последовательность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ar_AuditДействия/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// AgentRunner для 1С
//
// Лицензия: MIT. Полный текст — в файле LICENSE в корне репозитория.
//
// Исходный код проекта:
// https://github.com/AI-1C-Expert/agentrunner
///////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////////////////////
// Общий модуль ar_AuditДействия (Аудит действий агента).
//
// Единственная точка записи журнала выполненных tool-действий агента в
// независимый регистр сведений ar_ДействияАгента. Запись делает диспетчер
// ar_ИнструментыДиспетчер после каждого вызова tool (успешного или ошибочного).
//
// Измерения регистра: ar_ИдентификаторЗапуска (UUID-строка 36) + ar_Последовательность (порядковый
// номер действия внутри запуска). Ресурсы: ar_ИмяИнструмента, ar_АргументыJSON,
// ar_УровеньРиска (EnumRef.ar_УровеньРиска), ar_СсылкаНаРезультат (навигационная ссылка),
// ar_КемПодтверждено (CatalogRef.Пользователи), ar_ДатаПодтверждения (Дата).
//
// Свойства модуля: Сервер, Привилегированный = Ложь (AUD-06: платформа
// запрещает Privileged=true в общих модулях расширений - "Cannot use
// privileged common modules in extensions", проверено при загрузке .cfe в
// реальную ИБ). Привилегии поднимает вызывающий код точечно -
// УстановитьПривилегированныйРежим(Истина)/Попытка...Исключение...(Ложь)/
// КонецПопытки/(Ложь) - через фасад ar_AuditЗащищённыйРежим
// (ЗаписатьДействиеПривилегированно) там, где он подключён, либо локально в
// вызывающем модуле. Ранее (AUD-03/AUD-04/AUD-05) привилегия выставлялась
// в манифесте - см. AUD-06 для истории смены механизма. Аналогично
// ar_AuditЗапуски / ar_AuditСобытия.
//
// Модуль не выбрасывает исключений наружу: сбой записи журнала действий не
// должен валить runtime-цикл агента. При ошибке пишется запись в журнал
// регистрации и возвращается Ложь.
//
// См. спеку: .docs/specs/DISP-01.md (вариант A), AUD-03, Plan §2.8, §3.1.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Записать выполненное действие агента в регистр ar_ДействияАгента.
//
// Идемпотентна по ключу (RunId, Sequence): повторный вызов с тем же ключом
// перезаписывает запись (независимый регистр, набор по измерениям).
//
// Параметры:
//  RunId          - Строка    - идентификатор запуска (UUID, длина 36). Обязателен.
//  Sequence       - Число     - порядковый номер действия внутри запуска (>= 0).
//  ИмяИнструмента - Строка    - имя инструмента (значение реквизита ar_Имя). Обрезается до 128.
//  АргументыJSON  - Строка    - JSON-аргументы вызова (для трассировки).
//  RiskLevel      - ПеречислениеСсылка.ar_УровеньРиска, Строка - уровень риска.
//                                Строка трактуется как имя значения перечисления.
//  ResultRef      - Строка, Произвольный - навигационная ссылка результата либо
//                                ссылочное значение (приводится через ar_Утилиты).
//                                Может быть пустой.
//  ДополнительныеДанные - Структура - опционально: {ApprovedBy, ApprovedAt}
//                                для commit-действий, прошедших approval, и/или
//                                {ДлительностьМС, ЗавершёнСОшибкой} (PERF-04).
//                                Может быть Неопределено.
//
// Возвращаемое значение:
//  Булево - Истина, если запись выполнена; Ложь при ошибке валидации/записи.
//
Функция Записать(Знач RunId, Знач Sequence, Знач ИмяИнструмента, Знач АргументыJSON,
		Знач RiskLevel, Знач ResultRef = "", Знач ДополнительныеДанные = Неопределено) Экспорт

	Попытка

		Если ТипЗнч(RunId) <> Тип("Строка") Или ПустаяСтрока(RunId) Тогда
			ЗаписатьПредупреждение(
				НСтр("ru = 'Действие не записано: пустой RunId';
					|en = 'Action not recorded: empty RunId'"));
			Возврат Ложь;
		КонецЕсли;

		НомерДействия = ?(ТипЗнч(Sequence) = Тип("Число"), Макс(0, Цел(Sequence)), 0);

		МенеджерЗаписи = РегистрыСведений.ar_ДействияАгента.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ar_ИдентификаторЗапуска    = Лев(RunId, 36);
		МенеджерЗаписи.ar_Последовательность = НомерДействия;

		МенеджерЗаписи.ar_ИмяИнструмента = ar_Утилиты.ОбрезатьДо(СтрокаЗначения(ИмяИнструмента), 128);
		МенеджерЗаписи.ar_АргументыJSON  = СтрокаЗначения(АргументыJSON);
		МенеджерЗаписи.ar_УровеньРиска     = ЗначениеRiskLevel(RiskLevel);
		МенеджерЗаписи.ar_СсылкаНаРезультат     = ar_Утилиты.ОбрезатьДо(
			ar_Утилиты.НавигационнаяСсылкаОбъекта(ResultRef), 300);

		ЗаполнитьДанныеApproval(МенеджерЗаписи, ДополнительныеДанные);
		ЗаполнитьДанныеPERF(МенеджерЗаписи, ДополнительныеДанные);

		МенеджерЗаписи.Записать(Истина);
		Возврат Истина;

	Исключение
		ЗаписатьОшибку(
			НСтр("ru = 'Ошибка записи действия агента в ar_ДействияАгента';
				|en = 'Failed to record agent action into ar_ДействияАгента'"),
			ИнформацияОбОшибке());
		Возврат Ложь;
	КонецПопытки;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполнить ресурсы approval (ApprovedBy / ApprovedAt) из дополнительных данных.
//
// Параметры:
//  МенеджерЗаписи        - РегистрСведенийМенеджерЗаписи.ar_ДействияАгента - менеджер
//                          записи, ресурсы которого заполняются данными approval.
//  ДополнительныеДанные  - Структура - {ApprovedBy, ApprovedAt} для commit-действий;
//                          может быть Неопределено или иного типа (тогда без действий).
//
Процедура ЗаполнитьДанныеApproval(МенеджерЗаписи, Знач ДополнительныеДанные)

	Если ТипЗнч(ДополнительныеДанные) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	ApprovedBy = Неопределено;
	Если ДополнительныеДанные.Свойство("ApprovedBy", ApprovedBy)
		И ТипЗнч(ApprovedBy) = Тип("СправочникСсылка.Пользователи") Тогда
		МенеджерЗаписи.ar_КемПодтверждено = ApprovedBy;
	КонецЕсли;

	ApprovedAt = Неопределено;
	Если ДополнительныеДанные.Свойство("ApprovedAt", ApprovedAt)
		И ТипЗнч(ApprovedAt) = Тип("Дата") Тогда
		МенеджерЗаписи.ar_ДатаПодтверждения = ApprovedAt;
	КонецЕсли;

КонецПроцедуры

// Заполнить ресурсы длительности вызова (ar_ДлительностьМС / ar_ЗавершёнСОшибкой)
// из дополнительных данных (PERF-04). Отсутствие ключей - штатная ситуация
// (регистр читается 0/Ложь по умолчанию, см. FillValue ресурсов) - без действий.
//
// Параметры:
//  МенеджерЗаписи        - РегистрСведенийМенеджерЗаписи.ar_ДействияАгента - менеджер
//                          записи, ресурсы которого заполняются данными длительности.
//  ДополнительныеДанные  - Структура - {ДлительностьМС, ЗавершёнСОшибкой}; может быть
//                          Неопределено, иного типа или без этих ключей (тогда без действий).
//
Процедура ЗаполнитьДанныеPERF(МенеджерЗаписи, Знач ДополнительныеДанные)

	Если ТипЗнч(ДополнительныеДанные) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;

	ДлительностьМС = Неопределено;
	Если ДополнительныеДанные.Свойство("ДлительностьМС", ДлительностьМС)
		И ТипЗнч(ДлительностьМС) = Тип("Число") Тогда
		МенеджерЗаписи.ar_ДлительностьМС = Макс(0, Цел(ДлительностьМС));
	КонецЕсли;

	ЗавершёнСОшибкой = Неопределено;
	Если ДополнительныеДанные.Свойство("ЗавершёнСОшибкой", ЗавершёнСОшибкой)
		И ТипЗнч(ЗавершёнСОшибкой) = Тип("Булево") Тогда
		МенеджерЗаписи.ar_ЗавершёнСОшибкой = ЗавершёнСОшибкой;
	КонецЕсли;

КонецПроцедуры

// Привести RiskLevel к ПеречислениеСсылка.ar_УровеньРиска.
// Строка трактуется как имя значения (Чтение/Черновик/Запись/Фиксация); неизвестное
// значение и пустота → Чтение (безопасный дефолт).
//
// Параметры:
//  RiskLevel - ПеречислениеСсылка.ar_УровеньРиска, Строка - уровень риска либо имя
//              значения перечисления (Чтение/Черновик/Запись/Фиксация).
//
// Возвращаемое значение:
//  ПеречислениеСсылка.ar_УровеньРиска - распознанное значение либо Чтение по умолчанию.
//
Функция ЗначениеRiskLevel(Знач RiskLevel)

	Если ТипЗнч(RiskLevel) = Тип("ПеречислениеСсылка.ar_УровеньРиска") Тогда
		Возврат RiskLevel;
	КонецЕсли;

	Если ТипЗнч(RiskLevel) = Тип("Строка") И Не ПустаяСтрока(RiskLevel) Тогда
		ЗначениеМД = Метаданные.Перечисления.ar_УровеньРиска.ЗначенияПеречисления.Найти(СокрЛП(RiskLevel));
		Если ЗначениеМД <> Неопределено Тогда
			Возврат Перечисления.ar_УровеньРиска[ЗначениеМД.Имя];
		КонецЕсли;
	КонецЕсли;

	Возврат Перечисления.ar_УровеньРиска.Чтение;

КонецФункции

// Безопасно привести значение к строке (Неопределено → "").
//
// Параметры:
//  Значение - Произвольный - значение любого типа для приведения к строке.
//
// Возвращаемое значение:
//  Строка - строковое представление значения; пустая строка при Неопределено.
//
Функция СтрокаЗначения(Знач Значение)
	Если Значение = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Возврат Значение;
	КонецЕсли;
	Возврат Строка(Значение);
КонецФункции

// Запись ошибки в журнал регистрации с маскировкой секретов.
// Best-effort: собственный сбой логирования подавляется и не пробрасывается
// наружу, чтобы не нарушить контракт «модуль не выбрасывает исключений».
//
// Параметры:
//  Заголовок            - Строка - заголовок сообщения об ошибке для журнала.
//  ИнформацияОбОшибке   - ИнформацияОбОшибке - сведения об исключении из блока
//                         Исключение (результат ИнформацияОбОшибке()).
//
Процедура ЗаписатьОшибку(Знач Заголовок, Знач ИнформацияОбОшибке)
	Попытка
		Текст = Заголовок + ": "
			+ ar_Утилиты.МаскироватьСекреты(ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'ar_AuditДействия'; en = 'aosAuditActions'"),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			Текст);
	Исключение
		// Логирование - best-effort: сбой самого логирования намеренно подавляем,
		// чтобы не нарушить контракт "модуль не выбрасывает исключений наружу".
		Возврат;
	КонецПопытки;
КонецПроцедуры

// Запись предупреждения в журнал регистрации.
//
// Параметры:
//  Текст - Строка - текст предупреждения; секреты маскируются перед записью.
//
Процедура ЗаписатьПредупреждение(Знач Текст)
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'ar_AuditДействия'; en = 'aosAuditActions'"),
		УровеньЖурналаРегистрации.Предупреждение,
		,
		,
		ar_Утилиты.МаскироватьСекреты(Текст));
КонецПроцедуры

#КонецОбласти
